import { create } from "zustand";
import {
  FaYoutube,
  FaXTwitter,
  FaWhatsapp,
  FaTiktok,
  FaFacebookF,
  FaLinkedinIn,
  FaInstagram,
} from "react-icons/fa6";
const articlesStore = create(() => ({
  socials: [
    { icon: FaInstagram, href: "https://instagram.com" },
    { icon: FaLinkedinIn, href: "https://linkedin.com" },
    { icon: FaFacebookF, href: "https://facebook.com" },
    { icon: FaTiktok, href: "https://tiktok.com" },
    { icon: FaWhatsapp, href: "https://whatsapp.com" },
    { icon: FaXTwitter, href: "https://x.com" },
    { icon: FaYoutube, href: "https://youtube.com" },
  ],
  navTopItems: [
    "נדל״ן למגורים",
    "התחדשות עירונית",
    "נדל״ן מניב והשקעות",
    "דעות וניתוחים",
    "חדשות הענף",
    "עיצוב ואדריכלות",
    "נדל״ן TV",
    "פודקאסטים",
  ],
  navBotItems: [
    "מדד התחדשות עירונית",
    "מחשבונים",
    "נדל״ן בראש צעיר",
    "אודות מרכז הנדל״ן",
    "מכללת מרכז הנדל״ן",
    "צור קשר",
  ],
  urbanRenewal: {
    img: "/banner2.png",
    alt: "התחדשות עירונית",
    title: "אושרה תוכנית העיצוב של צמח המרמן ואזורים למגדל יוקרה במתחם דפנה",
    content:
      "כשנתיים לאחר הזכייה במכרז דיירים, אושרה תוכנית העיצוב האדריכלי לפרויקט פינוי-בינוי במסגרתו ייהרסו במכרז ת'א 66 דירות וייבנה מגדל בן 25 קומות",
    date: "24.09",
    author: "דורון ברויטמן",
  },

  investmentsSection: {
    img: "/banner3.png",
    alt: "Profitable real estate and investments",
    title: "גבאי גייסה 112 מליון מתוך 144 מליון שקל בגיוס לסדרת אג'ח חדשה",
    date: "25.09",
    author: "דרור ניר קסטל",
  },

  housingSection: {
    img: "/banner4.png",
    alt: 'נדל"ן למגורים',
    title: "הליך מהיר להיטלי השבחה עד 90 אלף שח: ועדת הפנים אישרה",
    date: "25.09",
    author: "דרור ניר קסטל",
  },
  realEstateTV: {
    img: "/video1.png",
    title: "מפנה מקום לחדש: אירוע הריסה של חברת אלרם בוטיק ברמברנדט 36",
    content:
      "תושבי בניין רמברנדט 36 בת'א באו להיפרד מהמבנה הישן לטובת בניין חדש, צעיר ונוצץץ שוחחנו עם מנכל חברת אלרם בוטיק, שי הראל, ונציגות הדיירים",
    date: "18.09.24",
    author: 'מרכז הנדל"ן',
    secondaryTitle:
      "מי אחראי? עד כמה המדינה והמחוקק צריכים להתערב בעסקאות התחדשות עירונית",
    seconadryImg: "/video2.png",
    secondaryAlt: "מי אחראי",
  },
  leftSection: [
    {
      img: "/real-estate-woman1.png",
      alt: "דעות וניתוחים",
      title:
        "מבינה מלאכותית ועוד סדרה בנטפליקס: מה יכולים משווקי הנדלן בישראל ללמוד מהקולגות בניו יורק?",
      date: "23.09",
      author: "גיל גורביץ",
    },
    {
      img: "/real-estate-woman2.png",
      alt: "נדלן מניב והשקעות",
      title: "גבאי גייסה 112 מליון מתוך 144 מליון שקל בגיוס לסדרת אגח חדשה",
      date: "25.09",
      author: "דרור ניר קסטל",
    },
    {
      img: "/left-section-banner.png",
      alt: "כל הפאנלים וההרצאות מהאירוע",
      type: "banner",
    },
    {
      img: "/real-estate-woman5.png",
      alt: "נדלן למגורים",
      title:
        "הליך מהיר להיטלי השבחה עד 90 אלף שח: ועדת הפנים אישרה את הצעת חוק שומה מוסכמת",
      date: "25.09",
      author: "מערכת מרכז נדלן",
    },
  ],
  topGridSection: [
    {
      img: "/real-estate-woman3.png",
      alt: "חדשות הענף",
      title:
        "בכירה במשרד השיכון: ״הרחבת הכפר רג'ר נועדה לאפשר למשפחות מהחלק הצפוני דיור משופר״",
      date: "24.09",
      author: "דורון ברויטמן",
    },
    {
      img: "/real-estate-woman2.png",
      alt: "נדל״ן מניב והשקעות",
      title: "גבאי גייסה 112 מיליון מתוך 144 מיליון שקל בגיוס לסדרת אג״ח חדשה",
      date: "25.09",
      author: "דרור ניר קסטל",
    },

    {
      img: "/real-estate-woman4.png",
      alt: "עיצוב ואדריכלות",
      title:
        "יש לי חדר משלי: כך תעצבו לנער המתבגר חדר פרקטי, עם טאצ׳ אישי ולא משעמם",
      date: "15.09",
      author: "עדי רופלד",
    },
  ],
  realEstateForResidence: {
    img: "/real-estate-woman5.png",
    alt: "נדלן למגורים",
    title:
      "הליך מהיר להיטלי השבחה עד 90 אלף שח: ועדת הפנים אישרה את הצעת חוק שומה מוסכמת",
    date: "25.09",
    author: "מערכת מרכז נדלן",
  },
  renewalUrban: {
    img: "/real-estate-woman6.png",
    alt: "התחדשות עירונית",
    title: "אלמוגים זכתה במכרז דיירים ותבנה 600 דירות בנווה שאנן בחיפה",
    date: "25.09",
    author: "מערכת מרכז הנדלן",
  },
  realEstateAndInvestments: {
    img: "/real-estate-woman2.png",
    alt: "נדלן מניב והשקעות",
    title: "גבאי גייסה 112 מליון מתוך 144 מליון שקל בגיוס לסדרת אגח חדשה",
    date: "25.09",
    author: "דרור ניר קסטל",
  },
  opinions: {
    img: "/real-estate-woman1.png",
    alt: "דעות וניתוחים",
    title:
      "מבינה מלאכותית ועוד סדרה בנטפליקס: מה יכולים משווקי הנדלן בישראל ללמוד מהקולגות בניו יורק?",
    date: "25.09",
    author: "מערכת מרכז הנדלן",
  },
  news: {
    img: "/real-estate-woman3.png",
    alt: "חדשות הענף",
    title: "מנכסים ובניין לחברת הבת: נטעלי משען-זכאי מונתה למנכלית גב-ים",
    date: "25.09",
    author: "מערכת מרכז הנדלן",
  },
  faceBehind: {
    img: "/real-estate-woman7.png",
    alt: "הפנים מאחורי",
    title:
      "ההתחדשות תתפוס מקום מרכזי משום שהיא פעילה בערים, בהן יש בניינים ישנים ומסוכנים מצד אחד, ומצד שני גם תשתיות קיימות",
    date: "25.09",
    author: "מערכת מרכז הנדלן",
  },
  design: {
    img: "/real-estate-woman4.png",
    alt: "עיצוב ואדריכלות",
    title:
      "יש לי חדר משלי: כך תעצבו לנער המתבגר חדר פרקטי, עם טאצ׳ אישי ולא משעמם",
    date: "25.09",
    author: "מערכת מרכז הנדלן",
  },
  podcasts: [
    {
      img: "/podcast1.png",
      alt: "פודקאסטים",
      name: "דן הלפרט",
      title: "מייסד ובעלים של דן הלפרט משרד עו״ד",
      content:
        "״מכיר המון זימים עם דן הלפרט מצגות יפות, ואחרי שנה אתה רואה שזה הכל בלון שמתפוצץ״",
      date: "24.09",
      author: "מערכת מרכז הנדלן",
    },
    {
      img: "/podcast2.png",
      alt: "פודקאסטים",
      name: "עו״ד דוד שני",
      title: "ראש הרשות לרישום והסדר זכויות מקרקעין",
      content:
        "״המעבר לרישום מקוון מונע את האפשרות למרמה וזיופים, או לפחות מקשה מאוד״",
      date: "24.09",
      author: "מערכת מרכז הנדלן",
    },
    {
      img: "/podcast2.png",
      alt: "פודקאסטים",
      name: "עו״ד דוד שני",
      title: "ראש הרשות לרישום והסדר זכויות מקרקעין",
      content:
        "״המעבר לרישום מקוון מונע את האפשרות למרמה וזיופים, או לפחות מקשה מאוד״",
      date: "24.09",
      author: "מערכת מרכז הנדלן",
    },
    {
      img: "/podcast3.png",
      alt: "פודקאסטים",
      name: "יעקב סיסו",
      title: "מייסד שותף קרן יסודות",
      content:
        "״היה לנו רעיון לאלפיקטציה שהצטרף כסף מחברים. בנינו ותכננו, אבל ויתרנו. אולי ויתרנו. אחרי שנתיים קמנו ביטו ופי בוקס״",
      date: "24.09",
      author: "מערכת מרכז הנדלן",
    },
  ],
  footerLinks: [
    {
      section: "מרכז הנדל״ן",
      links: [
        "אודות מרכז הנדל״ן",
        "צור קשר",
        "תגיות",
        "מפת אתר",
        "תנאי שימוש",
        "פסגת הנדל״ן",
        "RSS",
        "חדשות נדל״ן",
        "חברות נדל״ן",
      ],
    },
    {
      section: "מדריכים כללי",
      links: [
        "בנייה ירוקה",
        "בקשה לרישום מקרקעין",
        "כוכב חניה",
        "הגדלות מחיר למשכן",
        "היתר בנייה",
        "חיפוש עסקאות נדל״ן",
        "תקן 21",
        "כיצד לאתר בקלות עסקאות נדל״ן",
        "בנית בית פרטי",
      ],
    },
    {
      section: "התחדשות עירונית",
      links: [
        "מדד ההתחדשות העירונית",
        "חברות נדל״ן מובילות בבינוי בינוי",
        "חברות נדל״ן מדורגות בתמ״א 38 - דירוג ארצי",
        "עורכי דין מדורגים בהתחדשות עירונית",
        "אדריכלים מדורגים בתמ״א 38",
        "אדריכלים מדורגים בבינוי בינוי",
        "שמאי בולטים בהתחדשות עירונית",
        "עורך דין להתחדשות עירונית",
        "הרשות להתחדשות עירונית",
      ],
    },
    {
      section: "רכישה והשכרת נדל״ן",
      links: [
        "היכן כדאי לרכוש דירה להשקעה",
        "מס רכישה דירה ראשונה",
        "מס נדל״ן",
        "ערבות בנקאית",
        "אישור עקרוני למשכנתא",
        "משכון",
        "חוזה שכירות בלתי מוגנת",
        "הסכם מכר",
        "טפסים של מיסוי מקרקעין",
      ],
    },
  ],
}));

export default articlesStore;
